Revit 2026 API

# SelectionPickObjects(ObjectType, ISelectionFilter, String, IListReference) Method

---
**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Reference> PickObjects(
	ObjectType objectType,
	ISelectionFilter selectionFilter,
	string statusPrompt,
	IList<Reference> pPreSelected
)
```
```vb
Public Function PickObjects (
	objectType As ObjectType,
	selectionFilter As ISelectionFilter,
	statusPrompt As String,
	pPreSelected As IList(Of Reference)
) As IList(Of Reference)
```
```cpp
public:
IList<Reference^>^ PickObjects(
	ObjectType objectType,
	ISelectionFilter^ selectionFilter,
	String^ statusPrompt,
	IList<Reference^>^ pPreSelected
)
```
```fsharp
member PickObjects :
        objectType : ObjectType *
        selectionFilter : ISelectionFilter *
        statusPrompt : string *
        pPreSelected : IList<Reference> -> IList<Reference>
```

#### Parameters

objectType ObjectType

selectionFilter ISelectionFilter

statusPrompt String

pPreSelected IListReference

#### Return Value

IListReference

#### Reference

Selection Class

PickObjects Overload

Autodesk.Revit.UI.Selection Namespace